'use client';

import BlogCard from '@/components/atoms/BlogCard';
import Title from '@/components/atoms/Title/indes';

const Blogs = () => {
  return (
    <div className='p-12 pt-5'>
      <Title
        title='دانش‌نامه بوم و بنا'
        description='با مقالات تخصصی بوم و بنا، دنیای املاک و اقامتگاه‌ها را حرفه‌ای‌تر بشناسید!  '
      />
      <div className='grid grid-cols-4 gap-5 mt-7'>
        <BlogCard
          image='/images/homeBanner.jpg'
          writerImage='/images/homeBanner.jpg'
          name='خانه تکانی عید را از کی و از کجا شروع کنیم؟'
          type='املاک'
          description='در این نوشتار می‌خواهیم برایتان شرح دهیم که خانه تکانی را چگونه شروع کنیم؟ اگر خانه ای بزرگ دارید و یا اگر می‌خواهید از خانه تکانی خسته نشوید و سال جدید را با خستگی و کوفتگی ناشی از خانه تکانی آغاز نکنید، پیشنهاد می‌کنیم با یک برنامه ریزی زمانی درست و حساب شده کارهای خانه را از نیمه زمستان یا روزهای پایانی بهمن ماه شروع کنید '
          writer='رویا کوهستانی '
          comments={580}
          star={4.5}
        />{' '}
        <BlogCard
          image='/images/homeBanner.jpg'
          writerImage='/images/homeBanner.jpg'
          name='خانه تکانی عید را از کی و از کجا شروع کنیم؟'
          type='املاک'
          description='در این نوشتار می‌خواهیم برایتان شرح دهیم که خانه تکانی را چگونه شروع کنیم؟ اگر خانه ای بزرگ دارید و یا اگر می‌خواهید از خانه تکانی خسته نشوید و سال جدید را با خستگی و کوفتگی ناشی از خانه تکانی آغاز نکنید، پیشنهاد می‌کنیم با یک برنامه ریزی زمانی درست و حساب شده کارهای خانه را از نیمه زمستان یا روزهای پایانی بهمن ماه شروع کنید '
          writer='رویا کوهستانی '
          comments={580}
          star={4.5}
        />{' '}
        <BlogCard
          image='/images/homeBanner.jpg'
          writerImage='/images/homeBanner.jpg'
          name='خانه تکانی عید را از کی و از کجا شروع کنیم؟'
          type='املاک'
          description='در این نوشتار می‌خواهیم برایتان شرح دهیم که خانه تکانی را چگونه شروع کنیم؟ اگر خانه ای بزرگ دارید و یا اگر می‌خواهید از خانه تکانی خسته نشوید و سال جدید را با خستگی و کوفتگی ناشی از خانه تکانی آغاز نکنید، پیشنهاد می‌کنیم با یک برنامه ریزی زمانی درست و حساب شده کارهای خانه را از نیمه زمستان یا روزهای پایانی بهمن ماه شروع کنید '
          writer='رویا کوهستانی '
          comments={580}
          star={4.5}
        />{' '}
        <BlogCard
          image='/images/homeBanner.jpg'
          writerImage='/images/homeBanner.jpg'
          name='خانه تکانی عید را از کی و از کجا شروع کنیم؟'
          type='املاک'
          description='در این نوشتار می‌خواهیم برایتان شرح دهیم که خانه تکانی را چگونه شروع کنیم؟ اگر خانه ای بزرگ دارید و یا اگر می‌خواهید از خانه تکانی خسته نشوید و سال جدید را با خستگی و کوفتگی ناشی از خانه تکانی آغاز نکنید، پیشنهاد می‌کنیم با یک برنامه ریزی زمانی درست و حساب شده کارهای خانه را از نیمه زمستان یا روزهای پایانی بهمن ماه شروع کنید '
          writer='رویا کوهستانی '
          comments={580}
          star={4.5}
        />
      </div>
    </div>
  );
};

export default Blogs;
